### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.function_session_manager_internal.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-auth-main-rg-01/providers/Microsoft.Web/sites/io-p-weu-auth-sm-int-func-01"
        name                                           = "io-p-weu-auth-sm-int-func-01"
        tags                                           = {
            "CostCenter"                                     = "TS310 - PAGAMENTI & SERVIZI"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Prod"
            "ManagementTeam"                                 = "IO Auth&Identity"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.1"
            "Owner"                                          = "IO"
            "Source"                                         = "https://github.com/pagopa/io-auth-n-identity-domain/tree/main/infra/resources/prod"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ health_check_eviction_time_in_min             = 0 -> 2
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.io_public_apim_api_itn.module.api_v2_public_io_web_profile.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "PUBLIC API for IO platform."
      + display_name          = "IO PUBLIC API V2"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-public-api-v2"
      + path                  = "public"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 2.0.0
                  title: IO API Public
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                servers:
                  - url: https://api.io.pagopa.it/public
                paths:
                  /api/v2/validate-profile-email:
                    get:
                      operationId: getTokenInfo
                      description: |
                        Validates the token and get email relative to a token.
                      parameters:
                        - in: header
                          name: x-pagopa-email-validation-token
                          required: true
                          schema:
                            $ref: "#/components/schemas/ValidationToken"
                      responses:
                        "200":
                          description: Found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/GetTokenInfoResponse'
                        "400":
                          description: Validation failed
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        "401":
                          description: Invalid token
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/UnauthorizedResponse'
                        "500":
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                    post:
                      operationId: validateProfileEmail
                      description: |
                        Validates the token and updates the user profile.
                      requestBody:
                        required: true
                        content:
                          application/json:
                            schema:
                              $ref: "#/components/schemas/ValidateProfileEmailPayload"
                      responses:
                        "200":
                          description: Status report
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ValidateProfileStatusReport'
                        "400":
                          description: Bad request
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                        "401":
                          description: Invalid token
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/UnauthorizedResponse'
                        "500":
                          description: Internal Server Error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJson'
                components:
                  schemas:
                    GetTokenInfoResponse:
                      oneOf:
                        - type: object
                          properties:
                            status:
                              type: string
                              enum:
                                - SUCCESS
                            profile_email:
                              $ref: "#/components/schemas/ProfileEmail"
                          required:
                            - profile_email
                            - status
                        - $ref: "#/components/schemas/ValidationErrorsObject"
                    UnauthorizedResponse:
                      type: object
                      properties:
                        status:
                          type: string
                          enum:
                            - FAILURE
                        reason:
                          type: string
                          enum:
                            - INVALID_TOKEN
                      required:
                        - status
                        - reason
                    ValidateProfileStatusReport:
                      oneOf:
                        - type: object
                          properties:
                            status:
                              type: string
                              enum:
                                - SUCCESS
                          required:
                            - status
                        - $ref: "#/components/schemas/ValidationErrorsObject"
                    ValidationErrorsObject:
                      type: object
                      properties:
                        status:
                          type: string
                          enum:
                            - FAILURE
                        reason:
                          type: string
                          enum:
                            - TOKEN_EXPIRED
                            - EMAIL_ALREADY_TAKEN
                        profile_email:
                              $ref: "#/components/schemas/ProfileEmail"
                      required:
                        - status
                        - reason
                        - profile_email
                    ProfileEmail:
                      type: string
                      format: email
                    ValidationToken:
                      type: string
                      pattern: "^[A-Za-z0-9]{26}:[A-Fa-f0-9]{24}$"
                      example: "01DPT9QAZ6N0FJX21A86FRCWB3:8c652f8566ba53bd8cf0b1b9"
                    ValidateProfileEmailPayload:
                      type: object
                      properties:
                        token:
                          $ref: "#/components/schemas/ValidationToken"
                      required:
                        - token
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: >-
                            A short, summary of the problem type. Written in english and
                            readable
                
                            for engineers (usually not suited for non technical stakeholders and
                
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence
                
                            of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.io_public_apim_api_itn.module.api_v2_public_io_web_profile.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-public-api-v2"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{io-fn3-public-url}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-fn3-public-key}}</value>
                    </set-header>
                    <cors>
                        <allowed-origins>
                            <origin>https://account.ioapp.it/</origin>
                        </allowed-origins>
                        <allowed-methods preflight-result-max-age="300">
                            <method>OPTIONS</method>
                            <method>GET</method>
                            <method>POST</method>
                        </allowed-methods>
                        <allowed-headers>
                            <header>Content-Type</header>
                            <header>Authorization</header>
                            <header>x-pagopa-email-validation-token</header>
                        </allowed-headers>
                    </cors>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.io_public_apim_api_itn.module.api_v2_public_io_web_profile.azurerm_api_management_product_api.this["io-public-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-public-api-v2"
      + id                  = (known after apply)
      + product_id          = "io-public-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

Plan: 3 to add, 1 to change, 0 to destroy.
```

</details>
